Конфигурация/Documents/СтрокаБанковскойВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СтрокаБанковскойВыписки</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцептовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоОрганизация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеестрПлатежейФизЛиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДанныеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ФормыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Безналичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наличная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ВводДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВводДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ПоручениеНаДвижениеДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствамПоПоручениям</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваПереданныеВОплатуПаев</xr:Item>
				<xr:Item>AccumulationRegister.ВводыВыводыАктивовВВалютеУчета</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаличные</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пай</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчетЕПС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДоговорТекстом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/СтрокаБанковскойВыписки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
		
	ЭтаФорма.РеестрПлатежей.Параметры.УстановитьЗначениеПараметра("СтрокаБанковскойВыписки", Объект.Ссылка);
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.РеестрПлатежейФизЛиц.Количество() > 0 И (Объект.РеестрПлатежейФизЛиц.Итог("Сумма") <> Объект.Сумма) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма документа не совпадает с суммой переводов от физических лиц!",,,, Отказ);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЭтаФорма.РеестрПлатежей.Параметры.УстановитьЗначениеПараметра("СтрокаБанковскойВыписки", Объект.Ссылка);
	
	Оповестить("БанковкиеВыписки.Обновить", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоменятьМестамиРасчетныеСчета(Команда)
	
	Если      Не ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
		Предупреждение("Не выбран расчетный счет.");
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.РасчетныйСчетКонтрагента) Тогда
		Предупреждение("Не выбран расчетный счет контрагента.");
		Возврат;
	КонецЕсли;
	
	ВладелецРасчетногоСчета            = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "ЮрФизЛицо");
	ВладелецРасчетногоСчетаКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетКонтрагента, "ЮрФизЛицо");
	
	Если ВладелецРасчетногоСчета <> ВладелецРасчетногоСчетаКонтрагента Тогда
		Предупреждение("Не совпадают владельцы расчетного счета и расчетного счета контрагента.");
		Возврат;
	КонецЕсли;
	
	врРасчетныйСчета = Объект.РасчетныйСчетКонтрагента;
	
	Объект.РасчетныйСчетКонтрагента = Объект.РасчетныйСчет;
	Объект.РасчетныйСчет            = врРасчетныйСчета;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
			
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	Для НомерСтроки = 1 По СтрЧислоСтрок(Объект.ИсходныеДанные) Цикл
		ТекСтрока = СтрПолучитьСтроку(Объект.ИсходныеДанные, НомерСтроки);
		
		Если      Найти(ТекСтрока, "Получатель1") > 0 Тогда
			ЭтаФорма.Получатель1 = СтрЗаменить(ТекСтрока, "Получатель1=", "");
		ИначеЕсли Найти(ТекСтрока, "Плательщик1") > 0 Тогда
			ЭтаФорма.Плательщик1 = СтрЗаменить(ТекСтрока, "Плательщик1=", "");
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Акцептование.Видимость = Истина;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АкцептованиеОпераций.Акцептант,
		|	АкцептованиеОпераций.Период КАК ДатаАкцепта,
		|	АкцептованиеОпераций.Представитель,
		|	АкцептованиеОпераций.Примечание
		|ИЗ
		|	РегистрСведений.АкцептованиеОпераций КАК АкцептованиеОпераций
		|ГДЕ
		|	АкцептованиеОпераций.Организация = &Организация
		|	И АкцептованиеОпераций.Операция = &Операция";
		
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("Операция", 	 Объект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЭтаФорма.АкцептованиеДата				= Выборка.ДатаАкцепта;
			ЭтаФорма.АкцептованиеАкцептант			= Выборка.Акцептант;
			ЭтаФорма.АкцептованиеПредставитель		= Выборка.Представитель;
			Элементы.ДекорацияАкцептовано.Видимость	= Истина;
		Иначе
			Элементы.ДекорацияАкцептовано.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ТекстИсходныхДанных.ТолькоПросмотр		= Не РольДоступна("ПолныеПрава");
	Элементы.РеестрПлатежейФизЛиц.ТолькоПросмотр 	= Не (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ОперацииБэкОфиса"));
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ОбновитьСписокВводовДС();
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаКлиенте
Процедура КомандаЗагрузитьПереводыФизЛиц(Команда)
	
	Если Объект.ВидДвижения <> ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход") Тогда
		Предупреждение("Загрузка возможна только для поступления денежных средств!");
		Возврат;
	КонецЕсли;
	
	Если Объект.РеестрПлатежейФизЛиц.Количество() > 0
		И Вопрос("Перед заполнением таблица переводов от физ. лиц будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да
	Тогда
		Возврат;
	КонецЕсли;
	
	Объект.РеестрПлатежейФизЛиц.Очистить();
	Отказ = Ложь;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = "Таблицы EXCEL (*.xls)|*.xls|Таблицы EXCEL (*.xlsx)|*.xlsx";

	Если Не ДиалогВыбора.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ДиалогВыбора.ПолноеИмяФайла);
		Excel.Sheets(1).Select();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	НомСтр = 3;
	ПроверитьШапку(Excel, НомСтр, Отказ);
	
	Если Не Отказ Тогда
		
		Пока НомСтр < 10000 Цикл // защита от зацикливания
			
			НомерСтроки			= СокрЛП(Excel.Cells(НомСтр, 2).Value);
			Клиент				= СокрЛП(Excel.Cells(НомСтр, 3).Value);
			НазначениеПлатежа	= СокрЛП(Excel.Cells(НомСтр, 5).Value);
			Сумма               = Excel.Cells(НомСтр, 4).Value;
			ЗаКого				= СокрЛП(Excel.Cells(НомСтр, 6).Value);
			
			Разделитель = " ### ";
			ДанныеФайла 		= Клиент + Разделитель + СокрЛП(Сумма) + Разделитель + НазначениеПлатежа + ?(ЗаКого = "", "", Разделитель + ЗаКого);
			
			Если НЕ (ЗначениеЗаполнено(Клиент) И ЗначениеЗаполнено(НазначениеПлатежа)) Тогда
				Прервать;
			КонецЕсли;
			
			СчетДУ = ПолучитьСчетДоверительногоУправления(НазначениеПлатежа, Объект.Организация, Объект.Дата, НомерСтроки);
			
			Если НЕ ЗначениеЗаполнено(СчетДУ) Тогда
				СчетДУ = ПредопределенноеЗначение("Справочник.СчетаДоверительногоУправления.ПустаяСсылка");
				//НомСтр = НомСтр + 1;
				//Продолжить;
			КонецЕсли;
			
			НоваяСтрока									= Объект.РеестрПлатежейФизЛиц.Добавить();
			НоваяСтрока.СчетДоверительногоУправления	= СчетДУ;
			НоваяСтрока.ДанныеФайла 					= ДанныеФайла;
			НоваяСтрока.Сумма							= Сумма;
									
			НомСтр = НомСтр + 1;
			
		КонецЦикла;	
	
	КонецЕсли; 
	
	Excel.DisplayAlerts = 0;
	Excel.ActiveWorkbook.Close();
	Excel.DisplayAlerts = 1;
	
	ОбновитьСписокВводовДС();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСчетДоверительногоУправления(Знач СтрокаКлиента, Организация, Дата, НомерСтроки)
	
	Результат = Неопределено;
	
	СтрокаКлиента = СокрЛП(СтрЗаменить(СтрокаКлиента, Символы.ПС, " "));
	//ИдентификаторНачалаНомера = "//"; // Так в образце
	//ПозицияНачалаНомера = СтрНайти(СтрокаКлиента, ИдентификаторНачалаНомера);
	//Если ПозицияНачалаНомера = 0 Тогда
	//	Возврат Результат;
	//КонецЕсли;
	//
	//ФИО = ТРег(СокрЛП(Лев(СтрокаКлиента, ПозицияНачалаНомера-1)));
	//ФИО = СтрЗаменить(ФИО, " ", "");  	
	//ПозицияПробела = СтрНайти(СтрокаКлиента, " ", НаправлениеПоиска.СНачала, ПозицияНачалаНомера + 4);
	//Если ПозицияПробела = 0 Тогда
	//	Возврат Результат;
	//КонецЕсли;
	//
	//КодКлиента = СокрЛП(Сред(СтрокаКлиента, ПозицияНачалаНомера + 2, ПозицияПробела - ПозицияНачалаНомера - 2));
	
	ИдентификаторНомера = "IIS";
	ПозицияНомера = СтрНайти(СтрокаКлиента, ИдентификаторНомера);
	Если ПозицияНомера = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	ПозицияПробела = СтрНайти(СтрокаКлиента, " ", НаправлениеПоиска.СНачала, ПозицияНомера);
	КодКлиента = СокрЛП(Сред(СтрокаКлиента, ПозицияНомера - 11, ПозицияПробела - ПозицияНомера + 11)); 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
	|ГДЕ
	|	НЕ СчетаДоверительногоУправления.ПометкаУдаления
	|	И СчетаДоверительногоУправления.Организация = &Организация
	|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
	|	И СчетаДоверительногоУправления.НомерДоговора = &НомерДоговора";
	
	//|	И РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество = &ФИО
	
	Запрос.УстановитьПараметр("НомерДоговора", КодКлиента);
	//Запрос.УстановитьПараметр("ФИО", ФИО);
	//Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоСчетовДУ = Выборка.Количество();
	Если КоличествоСчетовДУ > 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Найдено " + СокрЛП(КоличествоСчетовДУ) + " счетов ДУ с номером договора " + КодКлиента + " (строка " + НомерСтроки + ")!");
		
		// Пока не заполняем
		Возврат Результат;
	ИначеЕсли КоличествоСчетовДУ = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден счет ДУ с номером договора " + КодКлиента + " (строка " + НомерСтроки + ")!");
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьШапку(Excel, НомСтр, Отказ)

	Если НЕ Отказ Тогда
	
		Пока НомСтр < 1000 Цикл // защита от зацикливания
			
			Если ЗначениеЗаполнено(Excel.Cells(НомСтр, 2).Value) Тогда
				
				ПоляШапки = Новый Массив;
				ПоляШапки.Добавить("Наименование плательщика");
				ПоляШапки.Добавить("Сумма");
				ПоляШапки.Добавить("Назначение платежа");
				ПоляШапки.Добавить("За кого");
								
				Для НомЯчейки = 3 По 6 Цикл
					Если НЕ СокрЛП(НРег(Excel.Cells(НомСтр, НомЯчейки).Value)) = НРег(ПоляШапки[НомЯчейки - 3]) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не найдено поле шапки """ + ПоляШапки[НомЯчейки - 3] + """'"),,,,Отказ);
					КонецЕсли;
				КонецЦикла; 
				
				НомСтр = НомСтр + 1;
				Прервать;
				
			Иначе
				
				НомСтр = НомСтр + 1;
				
			КонецЕсли; 
			
		КонецЦикла;
		
		Если НомСтр = 1000 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Шапка не найдена'"),,,,Отказ);
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура КомандаСоздатьВводыДенежныхСредств(Команда)
	
	Если Объект.РеестрПлатежейФизЛиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка)
		И Вопрос("Перед созданием вводов денежных средств документ будет записан. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да
	Тогда
		Возврат;
	КонецЕсли;
	
	Записан = Записать();
	
	Если Записан Тогда
		КомандаСоздатьВводыДенежныхСредствНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура КомандаСоздатьВводыДенежныхСредствНаСервере()
	
	// Чтобы избежать дублирования, обновим список перед созданием документов
	ОбновитьСписокВводовДС();
	
	Для Каждого ТекСтрокаРеестра Из Объект.РеестрПлатежейФизЛиц Цикл  
		Если Не ЗначениеЗаполнено(ТекСтрокаРеестра.СчетДоверительногоУправления) Тогда
			Продолжить;
		КонецЕсли;
		СоздатьПерезаполнитьВводДС(ТекСтрокаРеестра, ЗначениеЗаполнено(ТекСтрокаРеестра.ВводДенежныхСредств));                  				
	КонецЦикла;
	
	ОбновитьСписокВводовДС();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПерезаполнитьВводДС(СтрокаТаблицы, Перезаполнить)
	
	// Для одновременного создания ввода ДС и начисления задолженности формируем в транзакции
	НачатьТранзакцию();
	
	ОбъектДокумента = ?(Перезаполнить, СтрокаТаблицы.ВводДенежныхСредств.ПолучитьОбъект(), Документы.ВводДенежныхСредств.СоздатьДокумент());
	
	// Заполняем все реквизиты во всех случаях
	ОбъектДокумента.Организация  					= Объект.Организация;
	ОбъектДокумента.СчетДоверительногоУправления 	= СтрокаТаблицы.СчетДоверительногоУправления;	
	ОбъектДокумента.Дата							= Объект.Дата;
	ОбъектДокумента.СтрокаБанковскойВыписки 		= Объект.Ссылка;
	ОбъектДокумента.ФормаДенежныхСредств			= Перечисления.ФормыДенежныхСредств.Безналичная;
	ОбъектДокумента.ВидОперации						= Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление;
	ОбъектДокумента.РасчетныйСчет					= Объект.РасчетныйСчет;
	ОбъектДокумента.Валюта							= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
	ОбъектДокумента.Контрагент						= Объект.Контрагент;
	ОбъектДокумента.РасчетныйСчетКонтрагента		= Объект.РасчетныйСчетКонтрагента;
	
	ОбъектДокумента.КоррСчет 						= БухгалтерскийУчет.ОпределитьСчетРасчетовПоДоговоруДоверительногоУправления(ОбъектДокумента.Дата, ОбъектДокумента.Организация, ОбъектДокумента.СчетДоверительногоУправления, ОбъектДокумента.ВидОперации);		
	ЗаполнитьСубконто1НаСервере(ОбъектДокумента);
	
	ОбъектДокумента.Ответственный = РаботаСПользователями.ТекущийПользователь();	
		
	ОбъектДокумента.Сумма = СтрокаТаблицы.Сумма;
	ОбъектДокумента.ДополнительныеСвойства.Вставить("АвтоматическоеФормирование", Истина);
	
	Попытка 
		ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,,);
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
	
	// Теперь обрабатываем документ начисления задолженности
	СоздатьНачислениеЗадолженности = Не ЗначениеЗаполнено(СтрокаТаблицы.НачислениеЗадолженности);
	ОбъектДокументаНачисления = ?(СоздатьНачислениеЗадолженности, Документы.НачислениеЗадолженности.СоздатьДокумент(), СтрокаТаблицы.НачислениеЗадолженности.ПолучитьОбъект());
	ОбъектДокументаНачисления.Заполнить(ОбъектДокумента.Ссылка);
	
	Попытка 
		ОбъектДокументаНачисления.Записать(РежимЗаписиДокумента.Проведение);
		ЗафиксироватьТранзакцию();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,,);
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСубконто1НаСервере(ОбъектДокумента)

	Если ОбъектДокумента.КоррСчет = ПланыСчетов.Основной.ЦелевоеФинансированиеВоеннойИпотекиПереданноеВОтчетномГоду Тогда // 86.4.1 - без субконто
		ОбъектДокумента.Субконто1 = Неопределено;
		
	ИначеЕсли ОбъектДокумента.КоррСчет = ПланыСчетов.Основной.РасчетыПоДоговоруДоверительногоУправленияИмуществом Тогда // 79.3 - контрагенты
		Если ЗначениеЗаполнено(ОбъектДокумента.СчетДоверительногоУправления) Тогда
			Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ОбъектДокумента.СчетДоверительногоУправления, ОбъектДокумента.Дата);
			ОбъектДокумента.Субконто1 = ?(ТипЗнч(Клиент) = Тип("СправочникСсылка.ЮрФизЛица"), Клиент, Неопределено);
		Иначе
			ОбъектДокумента.Субконто1 = Неопределено
		КонецЕсли;
		
	ИначеЕсли ОбъектДокумента.КоррСчет = ПланыСчетов.Основной.УслугиБрокера Тогда // 60.5 - контрагенты, договоры
		ОбъектДокумента.Субконто1 = ОбъектДокумента.Контрагент;
		
	ИначеЕсли ОбъектДокумента.КоррСчет = ПланыСчетов.Основной.ПрочиеДоходы Тогда // 91.1.1 - комментарии излишни
		Если ОбъектДокумента.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваДоходПоПаямЗПИФ Тогда
			ОбъектДокумента.Субконто1 = Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Доходы по паям ЗПИФ");
		ИначеЕсли ОбъектДокумента.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваПроцентЗаПользованиеДенежнымиСредствами Тогда
			ОбъектДокумента.Субконто1 = Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Проценты на остаток денежных средств на расчетном счете");
		КонецЕсли;
		
	ИначеЕсли ОбъектДокумента.КоррСчет = ПланыСчетов.Основной.РасчетыПоПретензиям Тогда // 76.2 - контрагенты
		ОбъектДокумента.Субконто1 = ОбъектДокумента.Контрагент;
		
	ИначеЕсли ОбъектДокумента.КоррСчет = ПланыСчетов.Основной.ЦелевоеФинансированиеПФРПереданноеВОтчетномГоду Тогда // 86.3.1 - транш (ввод дс)
		ОбъектДокумента.Субконто1 = ОбъектДокумента.Ссылка;
		
	ИначеЕсли ОбъектДокумента.КоррСчет = ПланыСчетов.Основной.ЧастьПенсионныхВзносовДляОбеспеченияИОУДПеречисленно Тогда // 79.5.2 - контрагенты
		ОбъектДокумента.Субконто1 = ОбъектДокумента.Контрагент;
		
	ИначеЕсли ОбъектДокумента.КоррСчет = ПланыСчетов.Основной.ПрибыльУбытокДУТекущегоПериода Тогда // 79.4.1 - контрагенты
		ОбъектДокумента.Субконто1 = ОбъектДокумента.Контрагент;
		
	ИначеЕсли ОбъектДокумента.КоррСчет = ПланыСчетов.Основной.РасчетыСАгентами Тогда // 76.10 - контрагенты
		ОбъектДокумента.Субконто1 = ОбъектДокумента.Контрагент;
		
	ИначеЕсли ОбъектДокумента.КоррСчет = ПланыСчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами Тогда // 76.9 - контрагенты
		ОбъектДокумента.Субконто1 = ОбъектДокумента.Контрагент;
		
	ИначеЕсли ОбъектДокумента.КоррСчет = ПланыСчетов.Основной.РасчетыПоАвансамВыданным Тогда // 60.2 - контрагенты
		ОбъектДокумента.Субконто1 = ОбъектДокумента.Организация.ЮрФизЛицо;  		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВводовДС()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВводДенежныхСредств.Ссылка КАК ВводДенежныхСредств,
	|	ВводДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	НачислениеЗадолженностиОснования.Ссылка КАК НачислениеЗадолженности
	|ИЗ
	|	Документ.ВводДенежныхСредств КАК ВводДенежныхСредств
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
	|		ПО ВводДенежныхСредств.Ссылка = НачислениеЗадолженностиОснования.Основание
	|			И (НачислениеЗадолженностиОснования.Ссылка.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющегоПлатаЗаРазмещение))
	|			И (НЕ НачислениеЗадолженностиОснования.Ссылка.ПометкаУдаления)
	|ГДЕ
	|	ВводДенежныхСредств.Организация = &Организация
	|	И НЕ ВводДенежныхСредств.ПометкаУдаления
	|	И ВводДенежныхСредств.СтрокаБанковскойВыписки = &Ссылка";	
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ТаблицаВводов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрокаРеестра Из Объект.РеестрПлатежейФизЛиц Цикл                                         		
		
		СчетДоверительногоУправления = ТекСтрокаРеестра.СчетДоверительногоУправления;
		
		Если ЗначениеЗаполнено(СчетДоверительногоУправления) Тогда
			НайдСтроки = ТаблицаВводов.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", СчетДоверительногоУправления));
			Если НайдСтроки.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(ТекСтрокаРеестра, НайдСтроки[0]);	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры
